; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depotprob48) (:domain depots)
(:objects
	depot0 depot1 - Depot
	distributor0 distributor1 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - Crate
	hoist0 hoist1 hoist2 hoist3 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate7)
	(at pallet1 depot1)
	(clear crate5)
	(at pallet2 distributor0)
	(clear crate3)
	(at pallet3 distributor1)
	(clear crate6)
	(at truck0 depot0)
	(at truck1 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 distributor0)
	(available hoist2)
	(at hoist3 distributor1)
	(available hoist3)
	(at crate0 depot0)
	(on crate0 pallet0)
	(at crate1 distributor0)
	(on crate1 pallet2)
	(at crate2 distributor0)
	(on crate2 crate1)
	(at crate3 distributor0)
	(on crate3 crate2)
	(at crate4 distributor1)
	(on crate4 pallet3)
	(at crate5 depot1)
	(on crate5 pallet1)
	(at crate6 distributor1)
	(on crate6 crate4)
	(at crate7 depot0)
	(on crate7 crate0)
)

(:goal (and
		(on crate0 crate7)
		(on crate1 pallet0)
		(on crate2 crate1)
		(on crate3 pallet2)
		(on crate4 pallet3)
		(on crate5 pallet1)
		(on crate6 crate0)
		(on crate7 crate4)
	)
))

; plan
1. (lift hoist2 crate3 crate2 distributor0)
   deleted: (at crate3 distributor0) (available hoist2) (on crate3 crate2) (clear crate3)
   added: (lifting hoist2 crate3) (clear crate2)
   goals met: 3 of 8
2. (load hoist2 crate3 truck1 distributor0)
   deleted: (lifting hoist2 crate3)
   added: (in crate3 truck1) (available hoist2)
   goals met: 3 of 8
3. (lift hoist2 crate2 crate1 distributor0)
   deleted: (at crate2 distributor0) (available hoist2) (on crate2 crate1) (clear crate2)
   added: (lifting hoist2 crate2) (clear crate1)
   goals met: 2 of 8
4. (load hoist2 crate2 truck1 distributor0)
   deleted: (lifting hoist2 crate2)
   added: (in crate2 truck1) (available hoist2)
   goals met: 2 of 8
5. (lift hoist2 crate1 pallet2 distributor0)
   deleted: (at crate1 distributor0) (available hoist2) (on crate1 pallet2) (clear crate1)
   added: (lifting hoist2 crate1) (clear pallet2)
   goals met: 2 of 8
6. (load hoist2 crate1 truck1 distributor0)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck1) (available hoist2)
   goals met: 2 of 8
7. (unload hoist2 crate3 truck1 distributor0)
   deleted: (available hoist2) (in crate3 truck1)
   added: (lifting hoist2 crate3)
   goals met: 2 of 8
8. (lift hoist0 crate7 crate0 depot0)
   deleted: (at crate7 depot0) (available hoist0) (on crate7 crate0) (clear crate7)
   added: (lifting hoist0 crate7) (clear crate0)
   goals met: 2 of 8
9. (load hoist0 crate7 truck0 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck0) (available hoist0)
   goals met: 2 of 8
10. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (available hoist0) (on crate0 pallet0) (clear crate0)
   added: (lifting hoist0 crate0) (clear pallet0)
   goals met: 2 of 8
11. (load hoist0 crate0 truck0 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck0) (available hoist0)
   goals met: 2 of 8
12. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 2 of 8
13. (unload hoist0 crate1 truck1 depot0)
   deleted: (available hoist0) (in crate1 truck1)
   added: (lifting hoist0 crate1)
   goals met: 2 of 8
14. (lift hoist3 crate6 crate4 distributor1)
   deleted: (at crate6 distributor1) (available hoist3) (on crate6 crate4) (clear crate6)
   added: (lifting hoist3 crate6) (clear crate4)
   goals met: 2 of 8
15. (drop hoist2 crate3 pallet2 distributor0)
   deleted: (lifting hoist2 crate3) (clear pallet2)
   added: (at crate3 distributor0) (available hoist2) (on crate3 pallet2) (clear crate3)
   goals met: 3 of 8
16. (drop hoist0 crate1 pallet0 depot0)
   deleted: (lifting hoist0 crate1) (clear pallet0)
   added: (at crate1 depot0) (available hoist0) (on crate1 pallet0) (clear crate1)
   goals met: 4 of 8
17. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 4 of 8
18. (load hoist3 crate6 truck0 distributor1)
   deleted: (lifting hoist3 crate6)
   added: (in crate6 truck0) (available hoist3)
   goals met: 4 of 8
19. (unload hoist0 crate2 truck1 depot0)
   deleted: (available hoist0) (in crate2 truck1)
   added: (lifting hoist0 crate2)
   goals met: 4 of 8
20. (drop hoist0 crate2 crate1 depot0)
   deleted: (lifting hoist0 crate2) (clear crate1)
   added: (at crate2 depot0) (available hoist0) (on crate2 crate1) (clear crate2)
   goals met: 5 of 8
21. (unload hoist3 crate7 truck0 distributor1)
   deleted: (available hoist3) (in crate7 truck0)
   added: (lifting hoist3 crate7)
   goals met: 5 of 8
22. (drop hoist3 crate7 crate4 distributor1)
   deleted: (lifting hoist3 crate7) (clear crate4)
   added: (at crate7 distributor1) (available hoist3) (on crate7 crate4) (clear crate7)
   goals met: 6 of 8
23. (unload hoist3 crate0 truck0 distributor1)
   deleted: (available hoist3) (in crate0 truck0)
   added: (lifting hoist3 crate0)
   goals met: 6 of 8
24. (drop hoist3 crate0 crate7 distributor1)
   deleted: (lifting hoist3 crate0) (clear crate7)
   added: (at crate0 distributor1) (available hoist3) (on crate0 crate7) (clear crate0)
   goals met: 7 of 8
25. (unload hoist3 crate6 truck0 distributor1)
   deleted: (available hoist3) (in crate6 truck0)
   added: (lifting hoist3 crate6)
   goals met: 7 of 8
26. (drop hoist3 crate6 crate0 distributor1)
   deleted: (lifting hoist3 crate6) (clear crate0)
   added: (at crate6 distributor1) (available hoist3) (on crate6 crate0) (clear crate6)
   goals met: 8 of 8
